Revit 2027 API
StairsRunType.TreadNosingPosition Property
 Represents on which edges of the nosing to apply the nosing profile.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TreadNosingPosition TreadNosingPosition { get; set; }
Public Property TreadNosingPosition As TreadNosingPosition
	Get
	Set
public:
property TreadNosingPosition TreadNosingPosition {
	TreadNosingPosition get ();
	void set (TreadNosingPosition value);
}
member TreadNosingPosition : TreadNosingPosition with get, set
Property Value
TreadNosingPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The run type has no tread so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace